{
    "uuid": [
        {
            "value": "83d3d524-6f7f-460e-9559-29ba19d08d5b"
        }
    ],
    "langcode": [
        {
            "value": "en"
        }
    ],
    "type": [
        {
            "target_id": "blog",
            "target_type": "node_type",
            "target_uuid": "a90c00e7-fd49-42a6-8cdb-e99ec16f7742"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2020-01-27T16:15:12+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "revision_uid": [
        {
            "target_type": "user",
            "target_uuid": "30bffdc0-96b3-4656-9078-3f8113359c60"
        }
    ],
    "revision_log": [],
    "status": [
        {
            "value": true
        }
    ],
    "uid": [
        {
            "target_type": "user",
            "target_uuid": "30bffdc0-96b3-4656-9078-3f8113359c60"
        }
    ],
    "title": [
        {
            "value": "Simplifying Drupal frontend with Single File Components"
        }
    ],
    "created": [
        {
            "value": "2019-10-06T16:10:53+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "changed": [
        {
            "value": "2020-01-27T16:15:12+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "promote": [
        {
            "value": true
        }
    ],
    "sticky": [
        {
            "value": false
        }
    ],
    "default_langcode": [
        {
            "value": true
        }
    ],
    "revision_translation_affected": [],
    "path": [
        {
            "alias": "",
            "pid": null,
            "langcode": "en"
        }
    ],
    "body": [
        {
            "value": "<main aria-label=\"Content\">\r\n<article itemscope=\"\" itemtype=\"http:\/\/schema.org\/BlogPosting\">\r\n<p>I’ve been thinking about ways to make Drupal frontend easier recently, and have been working on an experimental module called Single File Components (SFC), which lets you put your CSS, JS, Twig, and PHP in one file. If you want to skip the blog (😭) you can just check out the project at&nbsp;<a href=\"https:\/\/www.drupal.org\/project\/sfc\">https:\/\/www.drupal.org\/project\/sfc<\/a>.<\/p>\r\n\r\n<p>The main problems with Drupal frontend SFC aims to help with are:<\/p>\r\n\r\n<ol>\r\n\t<li>Organizing Drupal frontend code is hard.<\/li>\r\n\t<li>Splitting your CSS\/JS into separate files and writing \"*.libraries.yml\" entries is tedious, especially with small files. Many themes have a single CSS\/JS bundle for this reason.<\/li>\r\n\t<li>Writing JS in the “correct” Drupal way is surprisingly hard, and rare to find even in popular contributed themes and modules.<\/li>\r\n\t<li>When Twig isn’t enough and you need PHP for something, it’s difficult to figure out where that goes and it’s often unclear that something like a preprocess is required for a Twig template to work.<\/li>\r\n\t<li>Testing frontend Twig and PHP is hard.<\/li>\r\n\t<li>Quickly providing custom Blocks, Layouts, and Field Formatters that use Twig templates is hard.<\/li>\r\n<\/ol>\r\n\r\n<p>It’s important to note that there are many other component-y solutions out there for Drupal, and most help with the same problems. Projects like Pattern Lab and Component Libraries are widely used and enjoyed by many, so please use them over SFC if they feel better to you! Open source isn’t a competition but with frontend it can often feel that way. Phew, glad that’s covered.<\/p>\r\n\r\n<p>Let’s get into it and start building a component. There are two ways to build components with SFC, but we’ll start with the simplest, which is to make a .sfc file in the “components” directory of any enabled module or theme. The component we’re building says “Hello” to users, so we’ll need some Twig that takes the name of the user, and some CSS to uniquely style it.<\/p>\r\n\r\n<p>Here’s say_hello.sfc:<\/p>\r\n\r\n<pre>\r\n<code>&lt;style&gt;\r\n  .say-hello {\r\n    font-size: 20px;\r\n  }\r\n&lt;\/style&gt;\r\n\r\n&lt;template&gt;\r\n  &lt;p class=\"say-hello\"&gt;Hello {{ name }}!&lt;\/p&gt;\r\n&lt;\/template&gt;\r\n<\/code><\/pre>\r\n\r\n<p>After a cache rebuild, you can now use this component anywhere by including it in a Twig template:<\/p>\r\n\r\n<pre>\r\n<code>{% include \"sfc--say-hello.html.twig\" with {\"name\": \"Sam\"} %}\r\n<\/code><\/pre>\r\n\r\n<p>Pretty cool right? There’s obviously a lot happening here that I’ve abstracted away from users, so here’s my quick rundown:<\/p>\r\n\r\n<ul>\r\n\t<li>*.sfc files are used by a service that derives SingleFileComponent plugins.<\/li>\r\n\t<li>A library definition is automatically generated because the component includes CSS.<\/li>\r\n\t<li>A custom Twig loader will create instances of SingleFileComponent plugins when they’re rendered and use their templates.<\/li>\r\n\t<li>An {{ attach_library(...) }} call is automatically prepended to the template.<\/li>\r\n\t<li>When assets for the library are collected, the component’s CSS is output to a separate file.<\/li>\r\n<\/ul>\r\n\r\n<p>The goal here is to make the end users, frontend developers, unaware of all the magic that makes this so easy. That’s what a module should do, right?<\/p>\r\n\r\n<p>Let’s try a more complicated component, one that counts how many times it has been clicked.<\/p>\r\n\r\n<p>Here’s click_counter.sfc:<\/p>\r\n\r\n<pre>\r\n<code>&lt;script data-type=\"attach\"&gt;\r\n  var count = 0;\r\n  $(this).on('click.sfc_click_counter', function () {\r\n    $(this).text('Clicked ' + ++count + ' times');\r\n  });\r\n&lt;\/script&gt;\r\n\r\n&lt;script data-type=\"detach\"&gt;\r\n  $(this).off('click.sfc_click_counter');\r\n&lt;\/script&gt;\r\n\r\n&lt;template&gt;\r\n  &lt;button class=\"click-counter\"&gt;Clicked 0 times&lt;\/button&gt;\r\n&lt;\/template&gt;\r\n\r\n&lt;?php\r\n$selector = '.click-counter';\r\n<\/code><\/pre>\r\n\r\n<p>This has a few new elements we should talk about. We’re writing JavaScript now, so there are &lt;script&gt; tags, but that data-type attribute is something unique to SFC. To make things easier for frontend developers, you can write attach\/detach code inside these special script tags, and just reference this, which is the element selected by your $selector.<\/p>\r\n\r\n<p>The code in these blocks is parsed and wrapped with a lot of other stuff - the actual output JS from this .sfc file is this:<\/p>\r\n\r\n<pre>\r\n<code>(function ($, Drupal, drupalSettings) {\r\n  Drupal.behaviors.sfc_click_counter = {\r\n    attach: function attach(context, settings) {\r\n      $(\".click-counter\", context).addBack(\".click-counter\").once('sfcAttach').each(function () {\r\n        var count = 0;\r\n        $(this).on('click.sfc_click_counter', function () {\r\n          $(this).text('Clicked ' + ++count + ' times');\r\n        });\r\n      });\r\n    },\r\n    detach: function detach(context, settings, trigger) {\r\n      $(\".click-counter\", context).addBack(\".click-counter\").once('sfcDetach').each(function () {\r\n        $(this).off('click.sfc_click_counter');\r\n      });\r\n      var element = $(\".click-counter\", context).addBack(\".click-counter\");element.removeOnce('sfcAttach');element.removeOnce('sfcDetach');\r\n    },\r\n  }\r\n})(jQuery, Drupal, drupalSettings);\r\n<\/code><\/pre>\r\n\r\n<p>To people familiar with Drupal, this code might make sense to you. But for modern frontend development, this is a ridiculous amount of scaffolding. This is how “correct” JS is meant to be written in Drupal: It should be inside a behavior, it should use attach\/detach, and it should use jQuery.once. Why should frontend developers have to write this code every time they’re trying to write a simple Drupal behavior? I figured that if the point of SFC is to simplify the frontend, it should try to make JS easier to write too.<\/p>\r\n\r\n<p>All that said, if you define a normal &lt;script&gt; tag without a data-type, it’ll be left as is. This is nice if you don’t like my magic scaffolding or want to define any global JS.<\/p>\r\n\r\n<p>So that’s the basics of defining a .sfc file, but as previously mentioned you can also define SingleFileComponent plugins as PHP classes.<\/p>\r\n\r\n<p>Here’s the same say_hello component as a class:<\/p>\r\n\r\n<pre>\r\n<code>&lt;?php\r\n\r\nnamespace Drupal\\example\\Plugin\\SingleFileComponent;\r\n\r\nuse Drupal\\Core\\Form\\FormStateInterface;\r\nuse Drupal\\sfc\\ComponentBase;\r\n\r\n\/**\r\n * Contains an example single file component.\r\n *\r\n * @SingleFileComponent(\r\n *   id = \"say_hello\",\r\n *   block = {\r\n *     \"admin_label\" = \"Say hello\",\r\n *   }\r\n * )\r\n *\/\r\nclass SayHello extends ComponentBase {\r\n\r\n  const TEMPLATE = &lt;&lt;&lt;TWIG\r\n&lt;p class=\"say-hello\"&gt;Hello {{ name }}!&lt;\/p&gt;\r\nTWIG;\r\n\r\n  const CSS = &lt;&lt;&lt;CSS\r\n.say-hello {\r\n  font-size: 20px;\r\n}\r\nCSS;\r\n\r\n  public function buildContextForm(array $form, FormStateInterface $form_state, array $default_values = []) {\r\n    $form['name'] = [\r\n      '#type' =&gt; 'textfield',\r\n      '#title' =&gt; $this-&gt;t('Name'),\r\n      '#default_value' =&gt; isset($default_values['name']) ? $default_values['name'] : '',\r\n    ];\r\n    return $form;\r\n  }\r\n\r\n  public function prepareContext(array &amp;$context) {\r\n    if (!isset($context['name'])) {\r\n      $context['name'] = \\Drupal::currentUser()-&gt;getDisplayName();\r\n    }\r\n  }\r\n\r\n}\r\n<\/code><\/pre>\r\n\r\n<p>Class components that extend ComponentBase define their CSS\/JS\/Twig in constants, and are used just like *.sfc components. This example does have some functional differences though - the annotation for the plugin includes a block key, which as you may guess allows class components to be used as blocks in the Block UI or Layout Builder. This saves developers from defining a separate block plugin themselves. Components can also have layout and field formatter plugins derived with similar annotations. I think component templates should be agnostic to how they’re used, but I’ve found that for components that act as layouts and field formatters that’s very hard to pull off, so don’t sweat it.<\/p>\r\n\r\n<p>The buildContextForm method in this example can be used by anyone consuming your component - if you’re deriving a block, layout, or field formatter the form will be used there, but it could be used in other user interfaces as well. The values from your form will be passed directly to your template, so make sure to sanitize them yourself.<\/p>\r\n\r\n<p>Finally, the prepareContext method allows you to write PHP that processes template context before it’s passed to Twig. This is great for grabbing default values, or doing anything that Twig can’t normally do. It’s nice to have the PHP code so close to the template, I’ve found that tracking down preprocesses and alters in themes to be quite difficult.<\/p>\r\n\r\n<p>Class components also support dependency injection, which means their PHP methods can be fully unit tested!<\/p>\r\n\r\n<p>For integration-style testing (any rendering of Twig is probably going to be an integration test), SFC provides two test traits. The first is meant for Kernel tests, and provides methods for render a component by its ID:<\/p>\r\n\r\n<pre>\r\n<code>$session = new UserSession([\r\n  'name' =&gt; 'Default',\r\n]);\r\n$proxy = new AccountProxy();\r\n$proxy-&gt;setAccount($session);\r\n\\Drupal::currentUser()-&gt;setAccount($proxy);\r\n$this-&gt;assertEquals('&lt;p class=\"say-hello\"&gt;Hello Default!&lt;\/p&gt;', $this-&gt;renderComponent('say_hello', []));\r\n<\/code><\/pre>\r\n\r\n<p>and for rendering component objects - which is nice when using mocks:<\/p>\r\n\r\n<pre>\r\n<code>$file_system = $this-&gt;createMock(FileSystemInterface::class);\r\n$current_user = $this-&gt;createMock(AccountProxyInterface::class);\r\n$current_user-&gt;method('getDisplayName')-&gt;willReturn('Default');\r\n$component = new SayHello([], 'say_hello', [], FALSE, 'vfs:\/', $file_system, $current_user);\r\n$this-&gt;assertEquals('&lt;p class=\"say-hello\"&gt;Hello Default!&lt;\/p&gt;', $this-&gt;renderComponentObject($component, []));\r\n<\/code><\/pre>\r\n\r\n<p>The other trait is for use with full-blown functional testing:<\/p>\r\n\r\n<pre>\r\n<code>$this-&gt;visitComponent(say_hello, []);\r\n$assert_session-&gt;pageTextContains(\"Hello Default!\");\r\n<\/code><\/pre>\r\n\r\n<p>You can also use this to test an individual component’s JS behavior!<\/p>\r\n\r\n<p>To manually test components you can enable the sfc_dev sub-module, which provides Drush commands for re-building component assets, and an interactive library that lets you play with all your single file components. Here’s a demo of using the live reloading feature of the library to change an existing component:<\/p>\r\n\r\n<p><strong>@todo video!<\/strong><\/p>\r\n\r\n<p>Test coverage is important to me, especially with complex frontend components, and SFC itself has 100% test coverage (in terms of executed lines), which is a first for one of my projects. Not sure if I’d do it again but it was pretty fun to test my skills out.<\/p>\r\n\r\n<p>That’s about all I have to say about what the module does - if you want to know more check out the project page at&nbsp;<a href=\"https:\/\/www.drupal.org\/project\/sfc\">https:\/\/www.drupal.org\/project\/sfc<\/a>, and make sure read the&nbsp;<a href=\"https:\/\/git.drupalcode.org\/project\/sfc\/blob\/8.x-1.x\/README.md\">README.md<\/a>&nbsp;file which goes into more detail about all these features.<\/p>\r\n\r\n<p>SFC is still in the alpha phase of development, so be wary that things might change a bit before its stable release. However, no major rewrites are wanted or planned.<\/p>\r\n\r\n<p>Thanks for reading and please try the module out!<\/p>\r\n<\/article>\r\n<\/main>\r\n\r\n<footer>&nbsp;<\/footer>\r\n",
            "format": "full_html",
            "summary": ""
        }
    ],
    "field_tags": [
        {
            "target_type": "taxonomy_term",
            "target_uuid": "d9871794-7262-415a-a18e-fc784794b1c9"
        },
        {
            "target_type": "taxonomy_term",
            "target_uuid": "23b07c20-ef0f-49f3-8dba-f3b1daa50c5e"
        }
    ]
}